In [7]:
import numpy as np
import pandas as pd
import seaborn as sns

In [10]:
titanic = sns.load_dataset('titanic')

In [13]:
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [15]:
# 랜덤으로 값을 보여줌. 기본으로 1개이고 원하는 수 만큼 입력하면 됨
titanic.sample()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
152,0,3,male,55.5,0,0,8.05,S,Third,man,True,NaN,Southampton,no,True

In [16]:
titanic.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

In [18]:
# numeric_only할 때 bool타입도 포함이 된다. Tue/False=1/0이라서 sub int임
titanic.sum(numeric_only=True)

survived        342.0000
pclass         2057.0000
age           21205.1700
sibsp           466.0000
parch           340.0000
fare          28693.9493
adult_male      537.0000
alone           537.0000
dtype: float64

In [20]:
titanic.mean(numeric_only=True)

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [21]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [62]:
nba = pd.read_csv('datas/nba.csv',
                 parse_dates=['Birthday'])
nba

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

In [58]:
nba.dtypes

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [59]:
nba.dtypes.value_counts()

object            3
datetime64[ns]    1
int64             1
dtype: int64

In [70]:
nba.ndim
nba.shape
nba.columns
nba.index

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [83]:
nba.isnull().sum()

Name        0
Team        0
Position    0
Birthday    0
Salary      0
dtype: int64

In [91]:
len(nba)

450

In [88]:
nba.count()

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64

In [92]:
# 전체 데이터의 값을 구하는 방법
nba.count().sum()

2250

In [93]:
# 속성은 그냥 쓰고 매소드는 뒤에() 붙는 애들
# 매소드는 행위를 하는 코드, 속성은 값이 담겨있는 느낌

In [103]:
# 칼럼마다 갖고 있는 고유값의 개수
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [101]:
# 칼럼마다 가장 큰 값
nba.max()

Name             Zylan Cheatham
Team         Washington Wizards
Position                     SG
Birthday    2000-12-23 00:00:00
Salary                 40231758
dtype: object

In [102]:
# 칼럼마다 가장 작은 값
nba.min()

Name               Aaron Gordon
Team              Atlanta Hawks
Position                      C
Birthday    1977-01-26 00:00:00
Salary                    79568
dtype: object

In [105]:
nba.loc[nba['Name']=='Aaron Gordon']

            Name           Team Position   Birthday    Salary
52  Aaron Gordon  Orlando Magic       PF 1995-09-16  19863636

In [106]:
nba.nlargest(5, columns=['Salary'])

                  Name                   Team Position   Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758
38          Chris Paul  Oklahoma City Thunder       PG 1985-05-06  38506482
219  Russell Westbrook        Houston Rockets       PG 1988-11-12  38506482
251          John Wall     Washington Wizards       PG 1990-09-06  38199000
264       James Harden        Houston Rockets       PG 1989-08-26  38199000

In [108]:
nba.nsmallest(5, ['Birthday'])

               Name               Team Position   Birthday    Salary
98     Vince Carter      Atlanta Hawks       PF 1977-01-26   2564753
196   Udonis Haslem         Miami Heat        C 1980-06-09   2564753
262     Kyle Korver    Milwaukee Bucks       PF 1981-03-17   6004753
149  Tyson Chandler    Houston Rockets        C 1982-10-02   2564753
415  Andre Iguodala  Memphis Grizzlies       SF 1984-01-28  17185185

In [115]:
nba.Salary.sum()
nba.Salary.mean()
nba.Salary.median()
nba.Salary.std()

9288810.298497694

In [120]:
nba['Salary']

0       1445697
1       1645357
2       3831840
3       7317074
4         79568
         ...
445     2174310
446     2578800
447     4767000
448     4764960
449    16200000
Name: Salary, Length: 450, dtype: int64

In [ ]:
titanic.sort_values('fare',ascending=False)

In [1]:
titanic.sort_values(by=['fare','age','sex'], ascending=[False,True,False], na_position='last')

NameError: name 'titanic' is not defined

In [ ]:
titanic

In [145]:
titanic['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [146]:
titanic.value_counts('sex').sort_values(ascending=False)

sex
male      577
female    314
dtype: int64

In [155]:
a = pd.DataFrame(range(10,22))
a

     0
0   10
1   11
2   12
3   13
4   14
5   15
6   16
7   17
8   18
9   19
10  20
11  21

In [158]:
a = pd.DataFrame(np.arange(10,22).reshape(3,4),
                index=list('abc'),
                columns=list('ABCD'))
a

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [172]:
a = pd.DataFrame(np.arange(10,22).reshape(3,4),
                index=list('abc'),
                columns=list('ABCD'))
# rows
a['b':'c']
a.loc['b':'c']
a.loc[['b','c']]
# cloumns
a[['B','C']]

    B   C
a  11  12
b  15  16
c  19  20

In [184]:
a.loc['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [185]:
a.A>15

a    False
b    False
c     True
Name: A, dtype: bool

In [187]:
a.loc[a.A>15]

    A   B   C   D
c  18  19  20  21

In [ ]:
# loc->label포함
# iloc->index 미포함

In [188]:
a.iloc[:2,-2:]

    C   D
a  12  13
b  16  17

In [201]:
# 1
titanic['age'].mean()

# 2
titanic.mean()

#3 
titanic.mean()

C:\Users\user\AppData\Local\Temp\ipykernel_13636\3907492540.py:5: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  titanic.mean()

survived       0.383838
pclass         2.308642
age           29.699118
sibsp          0.523008
parch          0.381594
fare          32.204208
adult_male     0.602694
alone          0.602694
dtype: float64

In [202]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [207]:
a=titanic.loc[titanic['sex']=='female']
a['age'].mean()

27.915708812260537

In [218]:
a=titanic.loc[titanic['sex']=='female']
b=a.loc[a['pclass']==1]
b['age'].mean()

34.61176470588235

In [287]:
from random import shuffle

team = pd.read_csv('datas/teams.csv')
name = team['성명']
gender = team['성별']

a = list(zip(name,gender))
shuffle(a)
b=pd.Series(a)
pd.DataFrame(b)

           0
0   (박수현, 여)
1   (유예빈, 여)
2   (조세연, 남)
3   (장서현, 여)
4   (조재희, 남)
5   (채경민, 남)
6   (유영은, 여)
7   (강호정, 남)
8   (김정인, 여)
9   (이윤진, 여)
10  (윤영주, 여)
11  (김지오, 여)
12  (이유단, 여)
13  (강예림, 여)
14  (최진명, 남)
15  (서덕원, 남)
16  (이주현, 여)
17  (고유리, 여)
18  (유준선, 남)
19  (유승현, 남)
20  (노재승, 남)
21  (임혜신, 여)
22  (배선화, 여)
23  (이주현, 남)
24  (박기영, 남)
25  (정현호, 남)
26  (한혜원, 여)
27  (김지성, 남)

In [342]:
import random

people = pd.read_csv('datas/teams.csv')
team = [_ for _ in range(1,8)]*4
random.shuffle(team)
people['team']=team

people.to_csv('datas/teams_result.csv', index=False)

In [346]:
a=pd.read_csv('datas/teams_result.csv')
b=a.sort_values('a')
b

KeyError: 'a'